*** Data Types & Values & Variables

#+begin_src scheme
(define x 1)
(set! x 5)
(set! x (+ x 1))
x
#+end_src

#+RESULTS:
: 6


